### Data Analysis with Pandas

##### Import and use Pandas

In [4]:
import pandas as pd
 
#create new series
numbers_series = pd.Series([1,2,3,4])
#print(number_series)

#create new Data Frame
user_data = pd.DataFrame({
    "Name": ["Hri", "Atit", "Sairash"],
    "Age": [20, 22, 22],
    "Address": ["Kathmandu", "Bhaktapur", "Kathmandu"]
})
user_data = pd.DataFrame(user_data)
user_data

      Name  Age    Address
0      Hri   20  Kathmandu
1     Atit   22  Bhaktapur
2  Sairash   22  Kathmandu

### Read data from CSV, Excel and JSON file

In [9]:
import pandas as pd
# read data from csv
student_csv_data = pd.read_csv('data/student.csv')
student_csv_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

### Read from excel

In [11]:
import pandas as pd
# read data from excel
student_excel_data = pd.read_excel('data/student.xlsx')
student_excel_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

### Read from JSON

In [12]:
import pandas as pd
# read data from json
student_json_data = pd.read_json('data/student.json')
student_json_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female